In [1]:
people = {
    "first_name":["Duyen le","Duyen le","NaN"],
    "last_name":"huu",
    "sdt":["0123","1234","3456"]
}

In [102]:
import pandas as pd
import random
import numpy as np

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1   Duyen le       huu  1234
2        NaN       huu  3456

In [5]:
df.sdt

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [6]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [7]:
df[['sdt','first_name']]

    sdt first_name
0  0123   Duyen le
1  1234   Duyen le
2  3456        NaN

In [8]:
df.columns

Index(['first_name', 'last_name', 'sdt'], dtype='object')

In [9]:
df.iloc[[0,1],2]

0    0123
1    1234
Name: sdt, dtype: object

In [10]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1   Duyen le       huu  1234
2        NaN       huu  3456

In [11]:
df.loc[[0,2],"sdt"]

0    0123
2    3456
Name: sdt, dtype: object

In [12]:
df.set_index('sdt',inplace=True)

In [13]:
df

     first_name last_name
sdt
0123   Duyen le       huu
1234   Duyen le       huu
3456        NaN       huu

In [14]:
df.index

Index(['0123', '1234', '3456'], dtype='object', name='sdt')

In [15]:
df.columns

Index(['first_name', 'last_name'], dtype='object')

In [16]:
df.reset_index(inplace=True)

In [17]:
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [18]:
df["first_name"] == "Duyen le"

0     True
1     True
2    False
Name: first_name, dtype: bool

In [19]:
filt = (df["first_name"] == "Duyen le") | (df["sdt"] == "3456")

In [20]:
df[filt]

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [21]:
df.loc[~filt,"sdt"]

Series([], Name: sdt, dtype: object)

In [22]:
df.columns

Index(['sdt', 'first_name', 'last_name'], dtype='object')

In [23]:
df.columns = [x.upper() for x in df.columns]
df.columns = [x.lower() for x in df.columns]

df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [24]:
df.columns = df.columns.str.replace(' ',"_")
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [25]:
df.rename(columns = {"fullname":"full_name","last_name":"middle_name"},inplace =True )

In [26]:
df

    sdt first_name middle_name
0  0123   Duyen le         huu
1  1234   Duyen le         huu
2  3456        NaN         huu

In [27]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.rename(columns={"full_name":"first_name"},inplace = True)

In [29]:
df.loc[0,['full_name','middle_name','first_name']] = ["fullname","middle","first_name"]
df

    sdt  first_name middle_name full_name
0  0123  first_name      middle  fullname
1  1234    Duyen le         huu       NaN
2  3456         NaN         huu       NaN

In [30]:
filt = (df['sdt'] > "1")

In [31]:
filt

0    False
1     True
2     True
Name: sdt, dtype: bool

In [32]:
df[filt]

    sdt first_name middle_name full_name
1  1234   Duyen le         huu       NaN
2  3456        NaN         huu       NaN

In [33]:
df.loc[filt,"midde_name"] = "hihi"

In [34]:
df['first_name'] = df['first_name'].str.lower()

In [35]:
df

    sdt  first_name middle_name full_name midde_name
0  0123  first_name      middle  fullname        NaN
1  1234    duyen le         huu       NaN       hihi
2  3456         nan         huu       NaN       hihi

In [36]:
 df['sdt'].apply(len)

0    4
1    4
2    4
Name: sdt, dtype: int64

In [37]:
def upperString(first_name):
    return first_name.upper();

In [38]:
df['first_name'] = df['first_name'].apply(upperString)
df

    sdt  first_name middle_name full_name midde_name
0  0123  FIRST_NAME      middle  fullname        NaN
1  1234    DUYEN LE         huu       NaN       hihi
2  3456         NAN         huu       NaN       hihi

In [39]:
df['full_name'] = df['midde_name'] = df['first_name'].apply(lambda x : x.upper())
df

    sdt  first_name middle_name   full_name  midde_name
0  0123  FIRST_NAME      middle  FIRST_NAME  FIRST_NAME
1  1234    DUYEN LE         huu    DUYEN LE    DUYEN LE
2  3456         NAN         huu         NAN         NAN

In [40]:
# df.apply(len,axis ="columns")
# df.apply(len,axis ="rows")

In [41]:
len(df.columns)

5

In [42]:
df.apply(pd.Series.min)

sdt                0123
first_name     DUYEN LE
middle_name         huu
full_name      DUYEN LE
midde_name     DUYEN LE
dtype: object

In [43]:
df.applymap(len)

   sdt  first_name  middle_name  full_name  midde_name
0    4          10            6         10          10
1    4           8            3          8           8
2    4           3            3          3           3

In [44]:
df.apply(len)

sdt            3
first_name     3
middle_name    3
full_name      3
midde_name     3
dtype: int64

In [45]:
df.applymap(str.lower)

    sdt  first_name middle_name   full_name  midde_name
0  0123  first_name      middle  first_name  first_name
1  1234    duyen le         huu    duyen le    duyen le
2  3456         nan         huu         nan         nan

In [46]:
# map thì chỉ thay đổi key có khai báo , ko khái báo sẽ thành NAN
# replace thì chỉ thay đổi key có khai báo , ko khái báo sẽ thành giá trị cũ
# df['first_name'] = df['first_name'].map({"first_name":"duyen1",'duyen le':"duyen2"})
df['first_name'] = df['first_name'].replace({"first_name":"duyen1",'duyen le':"duyen2"})

In [47]:
df['first_name'] = df["full_name"].apply(lambda x:x.lower())

In [48]:
df['full_name'] = df['full_name'].replace({"FIRST_NAME":"huu duyen","NAN":"Ha ha"})

In [49]:
df.drop(columns=["midde_name"],inplace=True)

In [50]:
df['full_name'].str.split(" ",expand=True)

       0      1
0    huu  duyen
1  DUYEN     LE
2     Ha     ha

In [51]:
df[["first","last"]] = df['full_name'].str.split(" ",expand=True)

In [52]:
df = df.append({"full_name":"Ngoc Tram"},ignore_index=True)

In [53]:
df

    sdt  first_name middle_name  full_name  first   last
0  0123  first_name      middle  huu duyen    huu  duyen
1  1234    duyen le         huu   DUYEN LE  DUYEN     LE
2  3456         nan         huu      Ha ha     Ha     ha
3   NaN         NaN         NaN  Ngoc Tram    NaN    NaN

In [54]:
df.loc[3,'first'],df.loc[3,'last'] =df.loc[3,'full_name'].split(" ")

In [55]:
people2 = {
    "full_name":["Duyen le 4","Duyen le 3","Duyen le 4"],
   
    "sdt":["0123","1234","3456"]
}
df2 = pd.DataFrame(people2)

In [56]:
df.append(df2,ignore_index=True,sort = True)

   first  first_name   full_name   last middle_name   sdt
0    huu  first_name   huu duyen  duyen      middle  0123
1  DUYEN    duyen le    DUYEN LE     LE         huu  1234
2     Ha         nan       Ha ha     ha         huu  3456
3   Ngoc         NaN   Ngoc Tram   Tram         NaN   NaN
4    NaN         NaN  Duyen le 4    NaN         NaN  0123
5    NaN         NaN  Duyen le 3    NaN         NaN  1234
6    NaN         NaN  Duyen le 4    NaN         NaN  3456

In [57]:
df

    sdt  first_name middle_name  full_name  first   last
0  0123  first_name      middle  huu duyen    huu  duyen
1  1234    duyen le         huu   DUYEN LE  DUYEN     LE
2  3456         nan         huu      Ha ha     Ha     ha
3   NaN         NaN         NaN  Ngoc Tram   Ngoc   Tram

In [59]:
df.drop(index=3,inplace=True)
df

KeyError: '[3] not found in axis'

In [60]:
df

    sdt  first_name middle_name  full_name  first   last
0  0123  first_name      middle  huu duyen    huu  duyen
1  1234    duyen le         huu   DUYEN LE  DUYEN     LE
2  3456         nan         huu      Ha ha     Ha     ha

In [122]:
filt = (df["middle_name"]=="huu")
filt

TypeError: unsupported operand type(s) for &: 'str' and 'str'

df.drop(index=df[filt].index)

In [157]:
df.loc[filt,"sdt"] =[random.randint(1,10000000) for k in df[filt].index ]
df

       sdt  first_name middle_name  full_name first   last
0        5  first_name      middle  huu duyen   huu  duyen
1  7639703         123         123        123   123    123
2  1046771         123         123        123   123    123

In [155]:
[random.randint(1,10000000) for k in df[filt].index ]

[5246582, 9043448]

In [158]:
df

       sdt  first_name middle_name  full_name first   last
0        5  first_name      middle  huu duyen   huu  duyen
1  7639703         123         123        123   123    123
2  1046771         123         123        123   123    123

In [159]:
df.sort_values(by="sdt",ascending = False)

       sdt  first_name middle_name  full_name first   last
1  7639703         123         123        123   123    123
2  1046771         123         123        123   123    123
0        5  first_name      middle  huu duyen   huu  duyen

In [176]:
df.sort_values(by=["first_name","sdt"],ascending = False)

       sdt first_name middle_name  full_name first   last
1  7639703        123         123        123   123    123
0        5         11      middle  huu duyen   huu  duyen
2  1046771          2         123        123   123    123